package codes.spectrum.conf2022.parsers

import codes.spectrum.conf2022.IDocTypeParser
import codes.spectrum.conf2022.doc_type.DocType
import codes.spectrum.conf2022.output.ExtractedDocument

class PassportParser : IDocTypeParser {
    override val docType: DocType = DocType.PASSPORT_RF

    override fun parse(input: String): ExtractedDocument? {
        val normalized = normalizeInput(input)
        if (normalized.length != 10) return null
        val isGoodOkatoCode = normalized.take(2) in validOkatoCodes
        val isGoodYear = normalized.drop(2).take(2).toInt().let { blankYear ->
            blankYear < 23 || blankYear > 90
        }
        val isValid = isGoodOkatoCode && isGoodYear
        return ExtractedDocument(docType, normalized, true, isValid)
    }

    private val validOkatoCodes = setOf(
        "01", // Алтайский край 	г Барнаул
        "03", // Краснодарский край 	г Краснодар
        "04", // Красноярский край 	г Красноярск
        "05", // Приморский край 	г Владивосток
        "07", // Ставропольский край 	г Ставрополь
        "08", // Хабаровский край 	г Хабаровск
        "10", // Амурская область 	г Благовещенск
        "11", // Архангельская область 	г Архангельск
        "12", // Астраханская область 	г Астрахань
        "14", // Белгородская область 	г Белгород
        "15", // Брянская область 	г Брянск
        "17", // Владимирская область 	г Владимир
        "18", // Волгоградская область 	г Волгоград
        "19", // Вологодская область 	г Вологда
        "20", // Воронежская область 	г Воронеж
        "22", // Нижегородская область 	г Нижний Новгород
        "24", // Ивановская область 	г Иваново
        "25", // Иркутская область 	г Иркутск
        "26", // Республика Ингушетия 	г Магас
        "27", // Калининградская область 	г Калининград
        "28", // Тверская область 	г Тверь
        "29", // Калужская область 	г Калуга
        "30", // Камчатский край 	г Петропавловск-Камчатский
        "32", // Кемеровская область - Кузбасс 	г Кемерово
        "33", // Кировская область 	г Киров
        "34", // Костромская область 	г Кострома
        "35", // Республика Крым 	г Симферополь
        "36", // Самарская область 	г Самара
        "37", // Курганская область 	г Курган
        "38", // Курская область 	г Курск
        "40", // Город Санкт-Петербург город федерального значения
        "41", // Ленинградская область 	г Санкт-Петербург
        "42", // Липецкая область 	г Липецк
        "44", // Магаданская область 	г Магадан
        "45", // Город Москва столица Российской Федерации город федерального значения
        "46", // Московская область 	г Москва
        "47", // Мурманская область 	г Мурманск
        "49", // Новгородская область 	г Великий Новгород
        "50", // Новосибирская область 	г Новосибирск
        "52", // Омская область 	г Омск
        "53", // Оренбургская область 	г Оренбург
        "54", // Орловская область 	г Орёл
        "56", // Пензенская область 	г Пенза
        "57", // Пермский край 	г Пермь
        "58", // Псковская область 	г Псков
        "60", // Ростовская область 	г Ростов-на-Дону
        "61", // Рязанская область 	г Рязань
        "63", // Саратовская область 	г Саратов
        "64", // Сахалинская область 	г Южно-Сахалинск
        "65", // Свердловская область 	г Екатеринбург
        "66", // Смоленская область 	г Смоленск
        "67", // Город федерального значения Севастополь
        "68", // Тамбовская область 	г Тамбов
        "69", // Томская область 	г Томск
        "70", // Тульская область 	г Тула
        "71", // Тюменская область 	г Тюмень
        "73", // Ульяновская область 	г Ульяновск
        "75", // Челябинская область 	г Челябинск
        "76", // Забайкальский край 	г Чита
        "77", // Чукотский автономный округ 	г Анадырь
        "78", // Ярославская область 	г Ярославль
        "79", // Республика Адыгея (Адыгея) 	г Майкоп
        "80", // Республика Башкортостан 	г Уфа
        "81", // Республика Бурятия 	г Улан-Удэ
        "82", // Республика Дагестан 	г Махачкала
        "83", // Кабардино-Балкарская Республика 	г Нальчик
        "84", // Республика Алтай 	г Горно-Алтайск
        "85", // Республика Калмыкия 	г Элиста
        "86", // Республика Карелия 	г Петрозаводск
        "87", // Республика Коми 	г Сыктывкар
        "88", // Республика Марий Эл 	г Йошкар-Ола
        "89", // Республика Мордовия 	г Саранск
        "90", // Республика Северная Осетия-Алания 	г Владикавказ
        "91", // Карачаево-Черкесская Республика 	г Черкесск
        "92", // Республика Татарстан (Татарстан) 	г Казань
        "93", // Республика Тыва 	г Кызыл
        "94", // Удмуртская Республика 	г Ижевск
        "95", // Республика Хакасия 	г Абакан
        "96", // Чеченская Республика 	г Грозный
        "97", // Чувашская Республика - Чувашия 	г Чебоксары
        "98", // Республика Саха (Якутия) 	г Якутск
        "99", // Еврейская автономная область 	г Биробиджан
    )

    private fun normalizeInput(input: String): String =
        input
            .uppercase()
            .replace('O', '0')
            .replace('О', '0')
            .replace('З', '3')
            .filter { it.isDigit() }
}
